app/controllers/users_controller.rb

INSERT INTO "users" ("name", "gender", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Viraj Chavan"], ["gender", "male"], ["email", "kajs@kjas.c"], ["password", "password123"], ["created_at", "2018-01-24 06:43:02.529827"], ["updated_at", "2018-01-24 06:43:02.529827"]]
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
UPDATE "users" SET "email" = ?, "password" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "harry@p.com"], ["password", "newpassword"], ["updated_at", "2018-01-24 09:13:35.000852"], ["id", 14]]
---
  def update
    @user = User.find(params[:id])
    if @user.update(user_params)